In [1]:
import pandas as pd

In [5]:
df=pd.DataFrame({
    'col1' : [1,2,3,4,5],
    'col2' : [45,56,67,34,34],
    'col3': 'ritesh kumar nahak ineur one'.split()
})

In [6]:
df

   col1  col2    col3
0     1    45  ritesh
1     2    56   kumar
2     3    67   nahak
3     4    34   ineur
4     5    34     one

In [12]:
# Creat a col4 and put value as square of col1

In [40]:
df['col4']=df['col1']**2

In [13]:
df

   col1  col2    col3  col4
0     1    45  ritesh     1
1     2    56   kumar     4
2     3    67   nahak     9
3     4    34   ineur    16
4     5    34     one    25

In [15]:
# Craet col 5 and put value as first letter of col3 string

In [41]:
df['col5']=df['col3'].str[0]

In [16]:
df

   col1  col2    col3  col4 col5
0     1    45  ritesh     1    r
1     2    56   kumar     4    k
2     3    67   nahak     9    n
3     4    34   ineur    16    i
4     5    34     one    25    o

In [42]:
# Creat a col4 and put value as square of col1 using outside fucnction

In [43]:
def test(a):
    return a**2

In [44]:
df['col4_4']=df['col1'].apply(test)

In [45]:
df

   col1  col2    col3  col4 col5  col4_4 col6 col6_6  col7  col7_7      col8
0     1    45  ritesh     1    r       1    r      r     5       6  3.806662
1     2    56   kumar     4    k       4    z      z     5       5  4.025352
2     3    67   nahak     9    n       9    z      z     5       5  4.204693
3     4    34   ineur    16    i      16    z      z     5       5  3.526361
4     5    34     one    25    o      25    z      z     5       3  3.526361

In [46]:
# Creat a col6 and put value as r if value in col 5 is r else put z

In [20]:
def test1(a):
    if a == 'r':
        return 'r'
    else:
        return 'z'

In [21]:
df['col6']=df['col5'].apply(test1)

In [22]:
df

   col1  col2    col3  col4 col5  col4_4 col6
0     1    45  ritesh     1    r       1    r
1     2    56   kumar     4    k       4    z
2     3    67   nahak     9    n       9    z
3     4    34   ineur    16    i      16    z
4     5    34     one    25    o      25    z

In [47]:
# Creat a col6 and put value as r if value in col 5 is r else put z(instead of ourside function use lamda)

In [25]:
df["col6_6"]=df["col5"].apply(lambda a:'r' if a == 'r' else 'z')

In [26]:
df

   col1  col2    col3  col4 col5  col4_4 col6 col6_6
0     1    45  ritesh     1    r       1    r      r
1     2    56   kumar     4    k       4    z      z
2     3    67   nahak     9    n       9    z      z
3     4    34   ineur    16    i      16    z      z
4     5    34     one    25    o      25    z      z

In [ ]:
# Craet col7 which will store length of string of col3

In [48]:
df['col7']=len(df['col3'])   # This is wrong approach..

In [30]:
df['col7_7']=df['col3'].apply(len)

In [31]:
df

   col1  col2    col3  col4 col5  col4_4 col6 col6_6  col7  col7_7
0     1    45  ritesh     1    r       1    r      r     5       6
1     2    56   kumar     4    k       4    z      z     5       5
2     3    67   nahak     9    n       9    z      z     5       5
3     4    34   ineur    16    i      16    z      z     5       5
4     5    34     one    25    o      25    z      z     5       3

In [36]:
# Craete col 8 which will hold log value of col2

In [37]:
import math   # as math package in not available in python core

In [38]:
df['col8']=df['col2'].apply(math.log)

In [39]:
df

   col1  col2    col3  col4 col5  col4_4 col6 col6_6  col7  col7_7      col8
0     1    45  ritesh     1    r       1    r      r     5       6  3.806662
1     2    56   kumar     4    k       4    z      z     5       5  4.025352
2     3    67   nahak     9    n       9    z      z     5       5  4.204693
3     4    34   ineur    16    i      16    z      z     5       5  3.526361
4     5    34     one    25    o      25    z      z     5       3  3.526361

In [50]:
# Lets learn NUMPY(numerical python)

In [51]:
import numpy as np

In [52]:
l=['ritu',2,4,5,6]

In [54]:
np.array(l)   # pass list in aray

array(['ritu', '2', '4', '5', '6'], dtype='<U11')

In [55]:
type(np.array(l))    #nd array = n dimension aray

numpy.ndarray

In [56]:
np.array([3,4,5,6,3.0])  # upcast all int to floating if one in floaing

array([3., 4., 5., 6., 3.])

In [59]:
a=np.array([[1,2],[3,4]])

In [60]:
a

array([[1, 2],
       [3, 4]])

In [61]:
# pull 4 out of a

In [62]:
# 1 is available in 0th row and 0th column similarly 4 is available at 1st row and 1st column

In [63]:
a[1][1]

4

In [64]:
a1=np.array([3,4,5,6,3.0])

In [65]:
a1[1]

4.0

In [68]:
np.array([1,2,3,4],ndmin=1)

array([1, 2, 3, 4])

In [69]:
np.array([1,2,3,4],ndmin=2)     # Two dimension array

array([[1, 2, 3, 4]])

In [70]:
np.array([1,2,3,4],ndmin=3)   # Three dimension array

array([[[1, 2, 3, 4]]])

In [71]:
a2=np.array([1,2,3,4],ndmin=3)

In [75]:
a2[0][0][0]     # as array is 3d array so give index 3 times

1

In [76]:
a      # this is 2 dimension array

array([[1, 2],
       [3, 4]])

In [78]:
np.asarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [79]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [80]:
np.mat([1,2,3,4,5])     # at min matrix will give 2 dimension only not less than that but array can have zero,1,2,3.....

matrix([[1, 2, 3, 4, 5]])

In [81]:
a=[1,2,3,4,5]

In [82]:
np.asanyarray(a)   # Here asanyarray convert list to array

array([1, 2, 3, 4, 5])

In [83]:
np.mat(a)   # matrix is subclass of array

matrix([[1, 2, 3, 4, 5]])

In [85]:
np.asanyarray(np.mat(a))    # Here asannyarray didnt covert matrix to array as asanyarray  first check whether somenthing is available in form of array 
# if not available in form of array then it wll convert .if available it wont convert to array.

matrix([[1, 2, 3, 4, 5]])

In [86]:
np.fromfunction(lambda i,j : i==j ,(3,3))

array([[ True, False, False],
       [False,  True, False],
       [False, False,  True]])

In [87]:
np.fromfunction(lambda i,j : i*j,(4,4))

array([[0., 0., 0., 0.],
       [0., 1., 2., 3.],
       [0., 2., 4., 6.],
       [0., 3., 6., 9.]])

In [88]:
np.fromfunction(lambda i,j : i*j,(4,4),dtype = int)

array([[0, 0, 0, 0],
       [0, 1, 2, 3],
       [0, 2, 4, 6],
       [0, 3, 6, 9]])

In [91]:
np.fromfunction(lambda i,j,k : i*j*k,(5,4,3),dtype = int)    # 3d matrix (3 array arranged in layer form)
# (5,4,3) means we want 5 such matrixes of 4*3

array([[[ 0,  0,  0],
        [ 0,  0,  0],
        [ 0,  0,  0],
        [ 0,  0,  0]],

       [[ 0,  0,  0],
        [ 0,  1,  2],
        [ 0,  2,  4],
        [ 0,  3,  6]],

       [[ 0,  0,  0],
        [ 0,  2,  4],
        [ 0,  4,  8],
        [ 0,  6, 12]],

       [[ 0,  0,  0],
        [ 0,  3,  6],
        [ 0,  6, 12],
        [ 0,  9, 18]],

       [[ 0,  0,  0],
        [ 0,  4,  8],
        [ 0,  8, 16],
        [ 0, 12, 24]]])

In [93]:
np.fromfunction(lambda i,j,k,l : i*j*k*l,(4,3,2,2),dtype = int)
#(4,3,2,2) means 2*2 array , 3 such array in one bundle ,4 such bundle

array([[[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 1]],

        [[0, 0],
         [0, 2]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 2]],

        [[0, 0],
         [0, 4]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 3]],

        [[0, 0],
         [0, 6]]]])

In [94]:
a=np.fromfunction(lambda i,j,k : i*j*k,(5,4,3),dtype = int)

In [95]:
a.ndim  # tell it is 3d array

3

In [96]:
a.size # total 60 element inside the array

60

In [97]:
a.shape

(5, 4, 3)

In [99]:
a.dtype

dtype('int32')

In [100]:
# Covert array to dataframe

In [101]:
pd.DataFrame(a)   # As dataframe is 2d array so u cant pass 3d,,,for 2d u can creat

ValueError: Must pass 2-d input. shape=(5, 4, 3)

In [102]:
# Creat a dataframe of 200 row and 100 column logic of values  is i*j

In [107]:
a=np.fromfunction(lambda i,j : i*j ,(200,100),dtype = int)

In [108]:
pd.DataFrame(a)

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
2,0,2,4,6,8,10,12,14,16,18,...,180,182,184,186,188,190,192,194,196,198
3,0,3,6,9,12,15,18,21,24,27,...,270,273,276,279,282,285,288,291,294,297
4,0,4,8,12,16,20,24,28,32,36,...,360,364,368,372,376,380,384,388,392,396
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,0,195,390,585,780,975,1170,1365,1560,1755,...,17550,17745,17940,18135,18330,18525,18720,18915,19110,19305
196,0,196,392,588,784,980,1176,1372,1568,1764,...,17640,17836,18032,18228,18424,18620,18816,19012,19208,19404
197,0,197,394,591,788,985,1182,1379,1576,1773,...,17730,17927,18124,18321,18518,18715,18912,19109,19306,19503
198,0,198,396,594,792,990,1188,1386,1584,1782,...,17820,18018,18216,18414,18612,18810,19008,19206,19404,19602
199,0,199,398,597,796,995,1194,1393,1592,1791,...,17910,18109,18308,18507,18706,18905,19104,19303,19502,19701

In [ ]:
## Random

In [109]:
np.random.rand(100,4)

array([[8.34221914e-01, 2.98534250e-02, 7.82167860e-01, 7.89617585e-01],
       [9.01250658e-01, 7.87954857e-02, 5.84720176e-01, 1.55363654e-01],
       [9.81560048e-01, 2.35348298e-01, 8.24760491e-01, 9.55550549e-01],
       [6.87968168e-01, 8.72269016e-01, 4.21881572e-01, 8.80949315e-01],
       [3.46716368e-01, 1.90425565e-01, 1.19067819e-01, 6.67665454e-01],
       [9.90263665e-01, 2.85301281e-02, 7.50397671e-01, 8.18583700e-01],
       [3.11518354e-01, 5.23091961e-01, 4.70406677e-01, 5.53414239e-01],
       [5.03260135e-01, 8.83394679e-01, 6.59995698e-02, 1.75250234e-01],
       [1.08738770e-03, 8.47039114e-01, 6.84345231e-01, 7.26036290e-01],
       [3.76827501e-01, 9.25040444e-01, 9.61819237e-01, 3.68682018e-01],
       [5.51406475e-01, 3.82141851e-01, 4.49364976e-01, 8.80814618e-01],
       [6.01214913e-01, 8.50728065e-01, 3.74260880e-01, 4.70768827e-01],
       [8.11804191e-01, 2.86042768e-01, 8.60026060e-01, 3.20274321e-01],
       [8.27485079e-01, 7.62085175e-01, 5.35127091e-01, 3.63744060e-01],
       [1.44383802e-01, 4.81080714e-01, 1.85369588e-01, 6.36227197e-01],
       [7.09481236e-01, 2.64791606e-01, 3.00154360e-01, 1.00256542e-01],
       [1.02682486e-01, 3.29409245e-01, 1.98068250e-01, 8.92269998e-01],
       [9.00012983e-01, 3.77740039e-01, 3.84650248e-01, 2.71809607e-01],
       [2.55109558e-01, 9.61093998e-01, 4.19484791e-01, 7.41812748e-01],
       [9.58348813e-01, 7.17275407e-01, 3.73918127e-01, 9.85350473e-01],
       [5.15399160e-01, 9.78031019e-01, 5.14733278e-01, 7.24020976e-01],
       [8.83691492e-01, 1.81290082e-01, 6.41409101e-01, 8.65062569e-02],
       [1.26518226e-01, 6.91528970e-01, 1.69086200e-01, 7.94601417e-01],
       [4.73969547e-01, 9.36812853e-01, 6.49265889e-01, 5.11433112e-03],
       [6.66060887e-01, 7.60282780e-01, 9.43587898e-02, 9.24308551e-02],
       [4.71475503e-01, 2.18933671e-01, 4.01646758e-01, 1.62815355e-01],
       [5.38888845e-01, 7.68501147e-01, 8.19131852e-01, 3.10960722e-01],
       [8.53672725e-01, 2.19307664e-01, 3.93965880e-02, 2.70339168e-01],
       [2.80340347e-02, 6.91533785e-01, 4.76502968e-01, 6.88195470e-01],
       [4.47334009e-01, 1.60457659e-01, 6.62725374e-01, 3.01906822e-01],
       [4.53572006e-01, 7.70448660e-01, 3.07461270e-01, 4.10664995e-01],
       [3.15951795e-01, 8.10798205e-01, 2.21854300e-01, 8.96241299e-01],
       [4.55607785e-01, 5.15549914e-01, 3.27667624e-01, 8.71842584e-01],
       [1.06835278e-02, 9.14788565e-01, 7.42646451e-01, 6.19239249e-01],
       [1.17594841e-01, 1.65645128e-01, 8.27443284e-01, 7.05658300e-01],
       [3.88091033e-01, 6.63332332e-01, 6.77829764e-01, 3.27808792e-01],
       [7.74045817e-01, 1.80988607e-01, 7.96702696e-01, 7.80740956e-01],
       [4.44103712e-01, 1.19266869e-01, 3.97040679e-01, 7.63940463e-01],
       [9.27643768e-01, 8.25001723e-01, 5.20883516e-01, 5.02686033e-01],
       [3.10028397e-01, 4.56644775e-01, 5.36866912e-01, 1.61384149e-01],
       [7.80669778e-03, 5.25469231e-01, 1.10541016e-01, 8.13115992e-01],
       [3.05548441e-02, 2.45095799e-01, 4.90516018e-01, 3.64027314e-01],
       [8.12251941e-01, 3.39110050e-01, 3.04344809e-01, 6.22427035e-01],
       [3.82542050e-01, 1.46926333e-01, 1.64158547e-01, 5.60242347e-01],
       [6.20369721e-01, 2.07330363e-01, 6.58985434e-01, 4.95550898e-01],
       [5.80832100e-01, 8.14671368e-01, 7.27058144e-01, 4.86224050e-01],
       [2.07076263e-01, 2.44310951e-01, 2.54980008e-01, 8.85175615e-01],
       [3.49592628e-01, 6.71862102e-02, 7.86965214e-01, 8.34005703e-01],
       [8.97250422e-01, 1.08647291e-01, 8.21393619e-02, 9.96214507e-01],
       [1.84366688e-01, 2.09079380e-01, 3.06131420e-01, 5.23337883e-02],
       [2.87978674e-01, 3.32459036e-01, 9.62552545e-01, 6.47926391e-01],
       [8.42446928e-01, 6.88962742e-01, 3.95389504e-01, 9.96074571e-01],
       [4.84180793e-01, 8.42834081e-01, 3.66956717e-01, 3.82099307e-01],
       [5.17035083e-01, 9.16856897e-01, 2.27443351e-01, 2.04196425e-01],
       [3.67466219e-01, 8.49854795e-01, 2.02972727e-01, 1.18937562e-01],
       [2.00987763e-01, 7.61886556e-01, 3.24500008e-01, 4.81179865e-01],
       [2.26466612e-01, 8.61379727e-01, 5.95193330e-02, 2.99671235e-01],
       [1.32468568e-01, 1.21315982e-01, 2.69911089e-02, 5.83079406e-01],
       [1.87568987e-01, 9.87205934e-01, 4.32415282e-01, 1.95884399e-01],
       [3.22356963e-01, 5.71118632e-01, 5.90282690e-01, 5.97493761e-01],
       [8.90428363e-01, 3.16419829e-01, 4.83606703e-01, 8.45677366e-01],
       [8.75228423e-01, 2.34447755e-01, 8.13516493e-01, 7.81761465e-01],
       [5.83234911e-01, 6.42451759e-01, 6.11541506e-01, 8.14514636e-01],
       [2.18878025e-01, 4.08082600e-01, 9.77795497e-01, 5.75514369e-01],
       [1.45896287e-01, 1.73284238e-01, 2.21707562e-01, 3.73213507e-01],
       [9.61798628e-01, 8.34446528e-01, 7.06716935e-01, 9.25838287e-01],
       [1.38645925e-01, 8.94716855e-01, 1.05890400e-01, 1.72790950e-01],
       [6.18688087e-02, 1.01182631e-01, 9.46424041e-01, 2.86505614e-01],
       [1.08342731e-01, 8.73685429e-01, 5.23480235e-01, 5.88680978e-01],
       [5.90868144e-01, 3.65042953e-01, 5.93332561e-02, 2.44771361e-01],
       [6.24862261e-01, 4.80023691e-02, 8.22899099e-01, 4.50695570e-01],
       [1.32318182e-01, 3.85443732e-01, 3.36228482e-01, 1.36465701e-01],
       [1.00453680e-01, 5.25715153e-01, 6.04947451e-01, 8.48462159e-01],
       [3.25547646e-01, 3.29440467e-01, 6.57099654e-01, 1.15859820e-02],
       [7.34718984e-01, 3.36316254e-01, 8.64789695e-01, 1.21965558e-01],
       [2.73512284e-01, 2.77637093e-01, 7.76215164e-01, 9.05717688e-01],
       [9.76299228e-01, 7.16475921e-01, 3.26562129e-01, 9.03501198e-01],
       [4.54325684e-01, 6.92416877e-02, 2.04872931e-01, 2.03083533e-01],
       [1.27348947e-01, 8.19185799e-01, 2.38315684e-01, 6.34096762e-01],
       [4.31573413e-01, 8.02903653e-01, 2.57110766e-01, 8.41389500e-01],
       [1.58250805e-01, 1.36995387e-01, 4.52970370e-01, 7.37500368e-01],
       [4.29134655e-01, 9.66696108e-01, 4.48976834e-01, 3.57437661e-01],
       [6.94562139e-01, 3.08770706e-01, 2.26662629e-01, 9.03563057e-01],
       [5.48469453e-01, 8.83003899e-01, 4.92495383e-01, 1.87263961e-01],
       [4.04951371e-01, 6.75133350e-01, 3.50818262e-02, 7.45962060e-01],
       [1.50475701e-01, 2.78201555e-05, 7.93676453e-01, 2.84027994e-01],
       [4.64702227e-01, 4.21709529e-01, 4.06393399e-01, 3.67481301e-01],
       [3.29230981e-01, 5.70884374e-01, 6.16628367e-01, 1.89767760e-01],
       [3.24617693e-01, 2.05068920e-01, 8.27751189e-01, 5.45677477e-01],
       [3.03152092e-01, 3.40808657e-01, 8.39038317e-01, 8.70806381e-01],
       [4.39467491e-01, 8.17218695e-01, 2.11116831e-01, 3.93861167e-01],
       [8.86658788e-01, 5.87013904e-01, 2.24809820e-01, 6.92653885e-01],
       [6.12786685e-01, 2.69271747e-01, 9.85352154e-04, 6.94394914e-01],
       [5.87613589e-01, 6.75877568e-01, 4.17117532e-02, 1.29279050e-01],
       [9.14241124e-01, 9.78649493e-01, 2.00950043e-01, 2.30555173e-01],
       [5.20148341e-01, 8.58673756e-01, 5.30501999e-01, 2.96373366e-01],
       [8.47168916e-01, 6.72469572e-01, 2.17948368e-01, 8.96622646e-01],
       [2.73177494e-01, 7.41602969e-01, 9.11951256e-01, 5.25941168e-01],
       [4.13990556e-01, 8.37849842e-01, 2.29254418e-01, 8.24423763e-01],
       [2.52228615e-01, 7.53026976e-01, 8.71197227e-01, 5.70948174e-01]])

In [111]:
np.random.randint(4,100)   # it will generate random ineger for you

61

In [115]:
np.random.randn(4,5)

array([[-0.63317101, -1.69442384,  0.18720066,  3.16483762, -0.49729474],
       [-0.12382513, -0.53891774, -0.37410302,  1.77991671,  0.19542961],
       [ 0.87305562, -0.46997944,  0.68109043, -0.63781641, -0.72125728],
       [-1.07098768,  1.46396224,  0.76546597,  0.37124763, -2.25643689]])

In [114]:
# Difference between rand and randn
#rand= will give random number 
#randn=will give random number but will have normal distribution(avg =0 and standard deviation =1)

In [116]:
pd.DataFrame(np.random.randn(4,5))

          0         1         2         3         4
0  0.205607  0.507262 -0.331664 -0.640434 -1.062765
1 -0.355627 -0.575158  1.262409 -0.742441  0.256821
2 -0.883565  0.955084  1.077151 -0.426439  1.619205
3 -0.608516 -0.256053 -0.483957 -0.174999  0.835045

In [ ]:
# Covert dimension from 3dto 2d to covet it to data frame

In [118]:
a=np.fromfunction(lambda i,j,k : i*j*k,(5,4,3),dtype = int)

In [119]:
a

array([[[ 0,  0,  0],
        [ 0,  0,  0],
        [ 0,  0,  0],
        [ 0,  0,  0]],

       [[ 0,  0,  0],
        [ 0,  1,  2],
        [ 0,  2,  4],
        [ 0,  3,  6]],

       [[ 0,  0,  0],
        [ 0,  2,  4],
        [ 0,  4,  8],
        [ 0,  6, 12]],

       [[ 0,  0,  0],
        [ 0,  3,  6],
        [ 0,  6, 12],
        [ 0,  9, 18]],

       [[ 0,  0,  0],
        [ 0,  4,  8],
        [ 0,  8, 16],
        [ 0, 12, 24]]])

In [120]:
a.reshape(10,6)
# (5,4,3)=60 for make i*j =60 for 2d

array([[ 0,  0,  0,  0,  0,  0],
       [ 0,  0,  0,  0,  0,  0],
       [ 0,  0,  0,  0,  1,  2],
       [ 0,  2,  4,  0,  3,  6],
       [ 0,  0,  0,  0,  2,  4],
       [ 0,  4,  8,  0,  6, 12],
       [ 0,  0,  0,  0,  3,  6],
       [ 0,  6, 12,  0,  9, 18],
       [ 0,  0,  0,  0,  4,  8],
       [ 0,  8, 16,  0, 12, 24]])

In [122]:
pd.DataFrame(a.reshape(10,6))

   0  1   2  3   4   5
0  0  0   0  0   0   0
1  0  0   0  0   0   0
2  0  0   0  0   1   2
3  0  2   4  0   3   6
4  0  0   0  0   2   4
5  0  4   8  0   6  12
6  0  0   0  0   3   6
7  0  6  12  0   9  18
8  0  0   0  0   4   8
9  0  8  16  0  12  24

In [123]:
# 3d to 4d

In [124]:
a=np.fromfunction(lambda i,j,k : i*j*k,(5,4,3),dtype = int)

In [125]:
a.reshape(2,2,3,5)

array([[[[ 0,  0,  0,  0,  0],
         [ 0,  0,  0,  0,  0],
         [ 0,  0,  0,  0,  0]],

        [[ 0,  1,  2,  0,  2],
         [ 4,  0,  3,  6,  0],
         [ 0,  0,  0,  2,  4]]],


       [[[ 0,  4,  8,  0,  6],
         [12,  0,  0,  0,  0],
         [ 3,  6,  0,  6, 12]],

        [[ 0,  9, 18,  0,  0],
         [ 0,  0,  4,  8,  0],
         [ 8, 16,  0, 12, 24]]]])

In [126]:
a.reshape(2,-1)  # System will automatcally check 60= 2*(possible multiples)
# you can take any negative number (-1 is not compulsion)

array([[ 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
         1,  2,  0,  2,  4,  0,  3,  6,  0,  0,  0,  0,  2,  4],
       [ 0,  4,  8,  0,  6, 12,  0,  0,  0,  0,  3,  6,  0,  6, 12,  0,
         9, 18,  0,  0,  0,  0,  4,  8,  0,  8, 16,  0, 12, 24]])

In [127]:
list(range(4,10,2))

[4, 6, 8]

In [128]:
list(range(4,10,0.2))   # in range u cant use float value so use arange in numpy

TypeError: 'float' object cannot be interpreted as an integer

In [131]:
np.arange(4,10,0.2)

array([4. , 4.2, 4.4, 4.6, 4.8, 5. , 5.2, 5.4, 5.6, 5.8, 6. , 6.2, 6.4,
       6.6, 6.8, 7. , 7.2, 7.4, 7.6, 7.8, 8. , 8.2, 8.4, 8.6, 8.8, 9. ,
       9.2, 9.4, 9.6, 9.8])

In [132]:
arr=np.random.rand(4,5)

In [133]:
arr

array([[0.10284651, 0.35595883, 0.30208721, 0.94537594, 0.78616973],
       [0.10447213, 0.52636108, 0.32227428, 0.87038677, 0.28786035],
       [0.06579315, 0.96013943, 0.39448334, 0.3364112 , 0.67500948],
       [0.85447018, 0.14019934, 0.53537148, 0.21002709, 0.50155894]])

In [134]:
# extract all data whicle has value greater than 0.5

In [137]:
arr[arr>0.5]  # similar to pandas

array([0.94537594, 0.78616973, 0.52636108, 0.87038677, 0.96013943,
       0.67500948, 0.85447018, 0.53537148, 0.50155894])

In [143]:
arr

array([[0.10284651, 0.35595883, 0.30208721, 0.94537594, 0.78616973],
       [0.10447213, 0.52636108, 0.32227428, 0.87038677, 0.28786035],
       [0.06579315, 0.96013943, 0.39448334, 0.3364112 , 0.67500948],
       [0.85447018, 0.14019934, 0.53537148, 0.21002709, 0.50155894]])

In [144]:
arr[[1,2],[2]]  # similar to pandas

array([0.32227428, 0.39448334])

In [145]:
arr=np.random.rand(8,5)

In [146]:
arr

array([[0.23004552, 0.91623938, 0.21605439, 0.15816665, 0.96548792],
       [0.99932324, 0.11083505, 0.14461143, 0.01435344, 0.98355499],
       [0.39433329, 0.78051032, 0.28213476, 0.86418334, 0.68266963],
       [0.00378116, 0.92008622, 0.85208946, 0.77844377, 0.06273544],
       [0.13246443, 0.15954389, 0.48610808, 0.93628679, 0.64859827],
       [0.74660062, 0.38486897, 0.00212645, 0.25122539, 0.7782427 ],
       [0.69840749, 0.01850266, 0.87520604, 0.54451978, 0.53630694],
       [0.25043334, 0.23967285, 0.38870113, 0.19695782, 0.52241339]])

In [147]:
arr[1:8,0:3]   # 1 to 7 row and 0 to 2 column data

array([[0.99932324, 0.11083505, 0.14461143],
       [0.39433329, 0.78051032, 0.28213476],
       [0.00378116, 0.92008622, 0.85208946],
       [0.13246443, 0.15954389, 0.48610808],
       [0.74660062, 0.38486897, 0.00212645],
       [0.69840749, 0.01850266, 0.87520604],
       [0.25043334, 0.23967285, 0.38870113]])

In [153]:
a2=arr[1:8,[0,1,2]]

In [154]:
a2

array([[0.99932324, 0.11083505, 0.14461143],
       [0.39433329, 0.78051032, 0.28213476],
       [0.00378116, 0.92008622, 0.85208946],
       [0.13246443, 0.15954389, 0.48610808],
       [0.74660062, 0.38486897, 0.00212645],
       [0.69840749, 0.01850266, 0.87520604],
       [0.25043334, 0.23967285, 0.38870113]])

In [155]:
# replace first data with 1111

In [157]:
a2[0][0] =1111

In [158]:
a2

array([[1.11100000e+03, 1.10835047e-01, 1.44611426e-01],
       [3.94333291e-01, 7.80510317e-01, 2.82134760e-01],
       [3.78115676e-03, 9.20086216e-01, 8.52089457e-01],
       [1.32464429e-01, 1.59543888e-01, 4.86108078e-01],
       [7.46600617e-01, 3.84868967e-01, 2.12644511e-03],
       [6.98407493e-01, 1.85026558e-02, 8.75206039e-01],
       [2.50433337e-01, 2.39672850e-01, 3.88701127e-01]])

In [159]:
a=np.array([[1,2],[3,4]])
b=np.array([[2,3],[4,5]])

In [161]:
a

array([[1, 2],
       [3, 4]])

In [162]:
b

array([[2, 3],
       [4, 5]])

In [160]:
a*b # its not matrix multiplication its just a element multipliction

array([[ 2,  6],
       [12, 20]])

In [163]:
m=a*b

In [164]:
m/0   # in numpy u wont get zero division error lke core python, it will show inf

C:\Users\dell\AppData\Local\Temp/ipykernel_9608/3791875896.py:1: RuntimeWarning: divide by zero encountered in true_divide
  m/0

array([[inf, inf],
       [inf, inf]])